; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph3 - mode
	image8 - mode
	spectrograph0 - mode
	image6 - mode
	infrared1 - mode
	spectrograph7 - mode
	infrared2 - mode
	thermograph5 - mode
	spectrograph4 - mode
	Star2 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image6)
	(supports instrument0 image8)
	(supports instrument0 spectrograph7)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph5)
	(supports instrument1 image6)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 infrared1)
	(supports instrument2 image6)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star1)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(pointing satellite0 Planet12)
	(have_image Star5 spectrograph4)
	(have_image Star5 thermograph3)
	(have_image Star5 infrared1)
	(have_image Phenomenon6 thermograph3)
	(have_image Phenomenon6 image8)
	(have_image Phenomenon7 spectrograph0)
	(have_image Phenomenon7 infrared1)
	(have_image Phenomenon7 image6)
	(have_image Planet8 spectrograph7)
	(have_image Phenomenon9 infrared2)
	(have_image Star10 image6)
	(have_image Star10 spectrograph4)
	(have_image Star10 spectrograph7)
	(have_image Planet11 infrared1)
	(have_image Planet11 thermograph3)
	(have_image Planet12 image6)
	(have_image Planet12 spectrograph4)
))

)

; plan
1. (turn_to satellite1 star1 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star1)
   goals met: 0 of 18
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 18
3. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 18
4. (turn_to satellite1 planet11 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet11)
   goals met: 0 of 18
5. (take_image satellite1 planet11 instrument2 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 1 of 18
6. (turn_to satellite1 phenomenon7 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 18
7. (turn_to satellite0 groundstation0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 18
8. (take_image satellite1 phenomenon7 instrument2 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 2 of 18
9. (take_image satellite1 phenomenon7 instrument2 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 3 of 18
10. (take_image satellite1 phenomenon7 instrument2 image6)
   added: (have_image phenomenon7 image6)
   goals met: 4 of 18
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 18
12. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 4 of 18
13. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 4 of 18
14. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 4 of 18
15. (turn_to satellite0 phenomenon6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 18
16. (take_image satellite0 phenomenon6 instrument0 image8)
   added: (have_image phenomenon6 image8)
   goals met: 5 of 18
17. (turn_to satellite0 phenomenon9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 18
18. (take_image satellite0 phenomenon9 instrument0 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 6 of 18
19. (turn_to satellite0 planet8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet8)
   goals met: 6 of 18
20. (take_image satellite0 planet8 instrument0 spectrograph7)
   added: (have_image planet8 spectrograph7)
   goals met: 7 of 18
21. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 7 of 18
22. (take_image satellite0 star10 instrument0 image6)
   added: (have_image star10 image6)
   goals met: 8 of 18
23. (take_image satellite0 star10 instrument0 spectrograph7)
   added: (have_image star10 spectrograph7)
   goals met: 9 of 18
24. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 9 of 18
25. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 9 of 18
26. (turn_to satellite0 groundstation3 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation3)
   goals met: 9 of 18
27. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 9 of 18
28. (turn_to satellite0 star10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star10)
   goals met: 9 of 18
29. (take_image satellite0 star10 instrument1 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 10 of 18
30. (turn_to satellite0 star5 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star5)
   goals met: 10 of 18
31. (take_image satellite0 star5 instrument1 infrared1)
   added: (have_image star5 infrared1)
   goals met: 11 of 18
32. (take_image satellite0 star5 instrument1 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 12 of 18
33. (turn_to satellite0 planet12 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet12)
   goals met: 13 of 18
34. (take_image satellite0 planet12 instrument1 image6)
   added: (have_image planet12 image6)
   goals met: 14 of 18
35. (take_image satellite0 planet12 instrument1 spectrograph4)
   added: (have_image planet12 spectrograph4)
   goals met: 15 of 18
36. (turn_to satellite1 groundstation3 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 groundstation3)
   goals met: 15 of 18
37. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 15 of 18
38. (turn_to satellite1 phenomenon6 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon6)
   goals met: 15 of 18
39. (take_image satellite1 phenomenon6 instrument3 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 16 of 18
40. (turn_to satellite1 planet11 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet11)
   goals met: 16 of 18
41. (take_image satellite1 planet11 instrument3 thermograph3)
   added: (have_image planet11 thermograph3)
   goals met: 17 of 18
42. (turn_to satellite1 star5 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star5)
   goals met: 17 of 18
43. (take_image satellite1 star5 instrument3 thermograph3)
   added: (have_image star5 thermograph3)
   goals met: 18 of 18
